import { useState } from "react";
import "./App.css";

const phrases = [
    "нєт",
    "ти увєрєна",
    "может всьо такі подумай",
    "ну піздец блять",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
    "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     "у тебе немає вибору",
     
     
];

document.querySelector(".yesButton") 
document.querySelector(".noButton")



function App() {
    const [noCount, setNoCount] = useState(0);
    const [yesPressed, setYesPressed] = useState(false);
    const yesButtonSize = noCount * 20 + 16;


    function handleNoClick() {
        setNoCount (noCount + 1);
    }

    function getNoButtonText() {
        return phrases[Math.min(noCount)];
    }

    return ( 
        <div className="valentine-container">
            {yesPressed ? (
                <>
                <img
                alt="cats kissing"
                src="https://media1.tenor.com/m/btWFp4pd0m8AAAAC/kiss-cat.gif"
                />
                <div className="text">юхууу!!!!</div>
                </>

            ) : (
                <>
                <img
                alt="cats happy"
                src="https://media1.tenor.com/m/05BGA8n3Eu8AAAAC/팡밍.gif"
                />

                <div>БУДЄШ МОЄЙ ВАЛЕНТІНКОЙ??</div> 
                <div>
                    <button 
                    style={{ fontSize: yesButtonSize}}
                    onClick={() => setYesPressed(true)}
                    class="yesButton">да</button>
                    <button onClick={handleNoClick} className="noButton"
                    >
                        {getNoButtonText()}
                    </button>
                </div>
                </>
            )}
            </div>
    );
        }
    export default App;
  